app/controllers/comments_controller.rb

INSERT INTO "comments" ("clip", "created_at", "name", "score", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["clip", "1388350052597.wav"], ["created_at", Sun, 29 Dec 2013 20:47:37 UTC +00:00], ["name", :fieldname], ["score", 0], ["updated_at", Sun, 29 Dec 2013 20:47:37 UTC +00:00]]
---
	def save_file
    audio = params[:audio]
    save_path = Rails.root.join("public/audio/#{audio.original_filename}")
    audio.rewind
      # Open and write the file to file system.
      File.open(save_path, 'wb') do |f|
        f.write audio.read
      end
    render :text=> 'hi'
    c = Comment.new
    c.name = "Brandon"
    c.clip = "#{audio.original_filename}"
    c.score = 0
    c.save!